# Brewfile

cask_args appdir: "/Applications"

tap "anomalyco/tap"
tap "hashicorp/tap"
tap "temporalio/brew"

# CLI tools
brew "bat"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "jq"
brew "mise"
brew "neovim"
brew "opencode", tap: "anomalyco/tap"
brew "ripgrep"
brew "tcld", tap: "temporalio/brew"
brew "temporal"
brew "tmux"
brew "tree-sitter"
brew "wget"
brew "vault", tap: "hashicorp/tap"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"

# Optional: macOS already includes these
# brew "git"
# brew "zsh"

# Desktop apps
# Commented out, already installed
# cask "brave-browser"
# cask "google-chrome"
# cask "obsidian"
# cask "slack"

cask "cursor"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "openvpn-connect"
cask "postman"
cask "raycast"
cask "sublime-text"
cask "zoom"
